from wall import Wall
level_objects = {
    "left_top_wall": (0, 0, 176, 10),
    "exit_1": (176, -1, 257, 1),
    "middle_top_wall": (257, 0, 736, 10),
    "exit_2":(736,-1,817,1),
    "right_top_wall": (817, 0, 983, 10),
    "right_wall": (983, 0, 993, 236),
    "bottom_wall": (0, 226, 993, 236),
    "left_wall": (0, 0, 10, 236),
    "box1":(11,208,50,225),
    "box2":(100,197,136,224),
    "box3":(136,208,159,224),
    "box4":(160,198,225,225),
    "ctelash_1":(234,201,310,225),
    "ctelash_2":(283,161,310,225),
    "какой-то щиток":(323,161,345,225),
    "another_boxes":(509,204,554,225),
    "green_boxes":(555,166,620,225),
    "boxeees":(633,196,711,225),
    "cardboard":(760,198,825,225),
    "closet":(877,182,982,255),
    "more cardboars..":(958,11,982,78),
    "СЕЙФ":(817,11,869,50),
    "эл.щиток":(672,11,736,31),
    "tables":(478,10,665,28),
    "режь_красный_провод":(45,11,129,19),
    "цифра":(11,36,19,73),
    "pork":(11,91,28,128),
    "morze":(11,146,19,183)
}

def create_walls():
    walls = [Wall(*coords) for coords in level_objects.values()]
    return walls